# AddSegment Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Fascia..::..AddSegment Method
Fascia Class See Also
---
Add segments to the fascia.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override void AddSegment(
	Reference targetRef
)
```

Visual Basic
---
```text
Public Overrides Sub AddSegment ( _
	targetRef As Reference _
)
```

Visual C++
---
```text
public:
virtual void AddSegment(
	Reference^ targetRef
) override
```

# ### Parameters
targetRef
    Type: Autodesk.Revit.DB..::..ReferenceSegment's reference on which want to be added.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | This exception will be thrown in following cases: 1\. Input targetRef is nullNothingnullptra null reference (Nothing in Visual Basic). 2\. Input targetRef is not nullNothingnullptra null reference (Nothing in Visual Basic) but contains nothing. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This exception will be thrown in following cases: 1\. Input targetRef has already been added into the fascia. 2\. Internal code fails to create the segment object. 3\. Regeneration fails. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | This exception will be thrown if the reference is suitable for creating a fascia as required. The reference allowed is : 1\. Model Line 2\. Roof's horizontal edges 3\. Soffit's horizontal edges 4\. Other fascia's horizontal edges |

# See Also
Fascia Class
Autodesk.Revit.DB.Architecture Namespace